In [47]:
import matplotlib.pyplot as plt
import numpy as np
import scipy.stats as stats
import math

In [3]:
data = {
    'name':['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres'],
    'age':[25,26,25,23,30,29,23,34,40,30,51,46],
    'rating':[4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65]
}

df = pd.DataFrame(data)

In [4]:
df

      name  age  rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [5]:
df.mean()

age       31.833333
rating     3.743333
dtype: float64

In [6]:
df.median()

age       29.50
rating     3.79
dtype: float64

In [7]:
df['age'].mode()

0    23
1    25
2    30
dtype: int64

In [13]:
df['period'] = df['age'].apply(lambda x: (x // 10)*10)

In [14]:
df

      name  age  rating  period
0      Tom   25    4.23      20
1    James   26    3.24      20
2    Ricky   25    3.98      20
3      Vin   23    2.56      20
4    Steve   30    3.20      30
5    Smith   29    4.60      20
6     Jack   23    3.80      20
7      Lee   34    3.78      30
8    David   40    2.98      40
9   Gasper   30    4.80      30
10  Betina   51    4.10      50
11  Andres   46    3.65      40

In [18]:
df['period'].mode()

0    20
dtype: int64

In [25]:
tgt_cols = ['age', 'period']

print(df[tgt_cols].min())
print('-'*50)
print(df[tgt_cols].max())

age       23
period    20
dtype: int64
--------------------------------------------------
age       51
period    50
dtype: int64

In [26]:
print(df[['age', 'period']].min())
print('-'*50)
print(df[['age', 'period']].max())

age       23
period    20
dtype: int64
--------------------------------------------------
age       51
period    50
dtype: int64

In [27]:
df.std()

age        9.232682
rating     0.661628
period    10.298573
dtype: float64

In [28]:
df.describe()

             age     rating     period
count  12.000000  12.000000  12.000000
mean   31.833333   3.743333  28.333333
std     9.232682   0.661628  10.298573
min    23.000000   2.560000  20.000000
25%    25.000000   3.230000  20.000000
50%    29.500000   3.790000  25.000000
75%    35.500000   4.132500  32.500000
max    51.000000   4.800000  50.000000

In [48]:
data = np.linspace(0, 100, 50)
mean = np.mean(data)
std = np.std(data)
# standardize
z = (data - mean) / std

In [51]:
print(f'z is {z}')
print('-'*100)

z_mean = np.mean(z)
print('z_mean is {:.3f}'.format(z_mean))
print('-'*100)

z_std = np.std(z)
print(f'z_std is {z_std}')

z is [-1.69774938 -1.62845348 -1.55915759 -1.4898617  -1.4205658  -1.35126991
 -1.28197402 -1.21267813 -1.14338223 -1.07408634 -1.00479045 -0.93549455
 -0.86619866 -0.79690277 -0.72760688 -0.65831098 -0.58901509 -0.5197192
 -0.4504233  -0.38112741 -0.31183152 -0.24253563 -0.17323973 -0.10394384
 -0.03464795  0.03464795  0.10394384  0.17323973  0.24253563  0.31183152
  0.38112741  0.4504233   0.5197192   0.58901509  0.65831098  0.72760688
  0.79690277  0.86619866  0.93549455  1.00479045  1.07408634  1.14338223
  1.21267813  1.28197402  1.35126991  1.4205658   1.4898617   1.55915759
  1.62845348  1.69774938]
----------------------------------------------------------------------------------------------------
z_mean is 0.000
----------------------------------------------------------------------------------------------------
z_std is 1.0

In [55]:
# arithmetic mean
array = [295, 300, 300, 310, 311]
np.mean(array)

303.2

In [56]:
# geometric mean
from scipy import stats
salary_growth = [1.05, 1.1, 1.3]
salary_growth_mean = stats.gmean(salary_growth)
salary_growth_mean

1.1450956868476592

In [58]:
# harmonic mean
v = [20, 60]
v_mean = stats.hmean(v)
v_mean

30.0

In [70]:
a = np.array([295, 300, 300, 310, 311])
a_mean = np.mean(a)
deviation = a - a_mean
deviation_sum = deviation.sum()
print(round(deviation_sum, ndigits=3))

0.0

In [67]:
type(deviation_sum)

numpy.float64